<script setup lang="ts">
import { onMounted } from "vue";

// Sections components
import BaseLayout from "@/layouts/sections/components/BaseLayout.vue";

</script>
<template>
  <BaseLayout title="NABCD" :breadcrumb="[{ label: '文档', route: '#' }, { label: 'NABCD' }]">
    <div class="border-radius-xl overflow-hidden shadow-lg mb-7 p-4 text-black">
      <h1 id="-need-">需要（Need）</h1>
      <ul>
        <li>
          用户群体：本软件的主要用户包括<strong>研究人员、研究生等中文论文写作人士</strong>。这些用户往往需要大量的时间来对论文进行拼写和语法纠错，所以他们需要一个能够自动检测和纠正论文中文语法错误的工具来<strong>提高论文质量，减少寻找和改正语法错误花费的时间</strong>。
        </li>
        <li>
          目标功能：本软件需要能够自动检测和标识论文中的<strong>拼写错误、语法错误、标点符号错误</strong>以及其他常见的语法问题。作为<strong>进阶</strong>的功能，我们还希望软件可以修正论文的<strong>格式和风格</strong>，进而提高使用者的论文被录用的概率。
        </li>
      </ul>
      <h1 id="-approach-">做法(Approach)</h1>
      <ul>
        <li>
          在解决学术论文中的拼写错误和语法错误问题方面，我们的方案基于大语言模型（LLM），主要是ChatGLM-6B模型，进行智能文本纠错系统的研发和完善。我们首先会生成一个高质量的学术论文数据集，然后通过对于ChatGLM-6B模型和其他传统模型如BERT模型的对比，找出各个模型在文本纠错任务上的优势和不足。在大语言模型表现不佳的任务上，我们会采用BERT等小模型进行辅助改进。
        </li>
        <li>
          在数据层面，我们会构建一个涵盖拼写错误、语法错误和逻辑错误等多种错误类型的高质量学术论文语病数据集。模型层面，我们将对ChatGLM-6B模型进行优化和微调，使其能够更好地识别和纠正语法错误，同时，我们也将利用BERT模型作为拼写错误检测的辅助工具。在系统层面，我们将研发一个用户友好的、具有高精确度和解释性的中文科研论文智能纠错系统，以降低学术界的论文纠错成本，提高科研效率。
        </li>
      </ul>
      <h1 id="-benefit-">优势(benefit)</h1>
      <h2 id="-">前端</h2>
      <ul>
        <li>安全性：为用户提供注册登录功能。</li>
        <li>用户友好性：前端既能接受html格式的文本，也能接受docx格式的文本。</li>
        <li>实时性：前端可以快速将用户输入的文本传递给后端进行进一步处理，实现即时的纠错反馈。</li>
      </ul>
      <h2 id="-">后端</h2>
      <ul>
        <li>强大的计算能力：后端可以部署在高性能服务器上，利用LLM模型进行大规模、高效的文本纠错处理。</li>
        <li>完善的用户注册与登录功能：后端与数据库连接，及时将用户的注册信息存储，同时运用flask_login维护登录状态。</li>
        <li>多样化的功能：除了基本的纠错功能，后端还计划支持更多的自然语言处理任务，如语义理解、上下文分析等，拓展系统的应用领域。</li>
        <li>可扩展性：后端可以根据需要灵活地调用不同版本的LLM模型，以适应不同的纠错需求或使用新的模型技术。</li>
      </ul>
      <h2 id="-">模型端</h2>
      <ul>
        <li>广泛的纠错类型处理：LLM模型在处理纠错任务时具有通用性，不仅适用于拼写错误，还可以发现并纠正其他类型的语法、格式、标点符号等各种文本错误。</li>
        <li>不断优化的能力：LLM模型可以通过大规模的训练数据进行学习，不断优化纠错能力，并在实际应用中逐渐提升准确性和效果。</li>
        <li>上下文感知：LLM模型在训练过程中可以通过学习大量的语言数据来理解上下文信息，并对不同的语法结构、语义关系进行建模，从而更准确地纠正文本中的错误。</li>
        <li>专业的应用场景：针对当前对论文方面纠错的应用较少的状况，LLM模型计划训练大量的学术论文集，提高对论文的纠错水平。</li>
      </ul>
      <h1 id="-competitors-">竞争(competitors)</h1>
      <h2 id="-">类似产品</h2>
      <h4 id="-">百度输入法</h4>
      <h6 id="-">优势</h6>
      <ul>
        <li>中文支持广泛：作为国内一款主流输入法，百度输入法在中文纠错方面表现出色，可以有效地检测和纠正中文文本中的拼写错误和语法错误。</li>
        <li>实时纠错：百度输入法可以在用户输入过程中实时进行纠错，及时标识出拼写错误，并提供合适的纠正建议，减少了用户后期修改的工作量。</li>
      </ul>
      <h6 id="-">劣势</h6>
      <ul>
        <li>偶尔的误判：由于模型的局限性，百度输入法在某些情况下可能会出现误判，将正确的文本标记为错误，或者未发现一些潜在的语言错误。</li>
        <li>对特定领域的纠错能力有限：百度输入法在某些专业领域的特定术语和行业用语的纠错能力相对较弱，可能无法提供准确的纠正建议。</li>
        <li>对大文本处理能力较弱：当文本较大时，可以明显看到处理效果下降。</li>
      </ul>
      <h1 id="-delivery-">推销(delivery)</h1>
      <h4 id="-">推销大语言模型下的文本智能纠错系统设计主要考虑以下几方面</h4>
      <h5 id="-">产品推广</h5>
      <ul>
        <li>确定目标客户群体：确定潜在客户，例如企业、学术机构、写作工作者等。</li>
        <li>开展市场调研：了解行业需求、竞争对手情况，为产品定位和差异化提供依据。</li>
        <li>制定营销策略：包括线上线下宣传推广、参加行业展会或研讨会、推出针对目标客户的定制化方案等。</li>
      </ul>
      <h5 id="-">销售</h5>
      <ul>
        <li>提供充分的产品信息：准确描述产品特点、功能优势和性能指标，帮助客户理解产品价值。</li>
        <li>建立合作关系：与潜在客户进行洽谈，提供产品演示，解答疑问，以达成合作意向。</li>
        <li>提供灵活的销售模式：根据客户需求，提供订阅、按量计费、定制化服务等多种销售模式。</li>
      </ul>
      <h5 id="-">用户培训及系统支持和维护</h5>
      <ul>
        <li>提供培训课程和教材：帮助用户了解产品的使用方法、操作流程和最佳实践。</li>
        <li>提供技术支持和解决方案：通过在线客服、电话支持等渠道，及时回答用户疑问、解决问题。</li>
        <li>定期更新和升级：及时修复漏洞和bug，并持续改进系统性能和功能，提供更好的用户体验。</li>
      </ul>
    </div>

  </BaseLayout>
</template>

<style scoped></style>